app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if user_params[:avatar] == "delete"
      @user.remove_avatar!
      @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Example User1"], ["updated_at", "2020-04-05 19:46:28.506294"], ["id", 1]]